# Cursor Extensions
# Install with: cat extensions.txt | grep -v '^#' | grep -v '^$' | xargs -L1 cursor --install-extension

# AI
anthropic.claude-code
openai.chatgpt

# Python
ms-python.python
ms-python.debugpy
charliermarsh.ruff
anysphere.cursorpyright

# Jupyter
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Databricks
databricks.databricks
andrewgross.databricks-notebook

# Docker / K8s
ms-azuretools.vscode-docker
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools

# Git
github.vscode-pull-request-github

# Frontend
svelte.svelte-vscode

# Markdown / Diagrams
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bpruitt-goddard.mermaid-markdown-syntax-highlighting
mermaidchart.vscode-mermaid-chart
vstirbu.vscode-mermaid-preview
davidanson.vscode-markdownlint
pomdtr.excalidraw-editor

# Data / Config
redhat.vscode-yaml
mechatroner.rainbow-csv
ms-vscode.makefile-tools

# Remote
anysphere.remote-containers

# Theme
pkief.material-icon-theme
teabyii.ayu
